w12/d2/benchbnb/app/controllers/api/benches_controller.rb

  def index
    @bench = Bench.all
---
SELECT "benches".* FROM "benches"

  def create
    @bench = Bench.create!(bench_params)
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "cool"], ["lat", 37.7757], ["lng", -122.4349], ["created_at", "2021-11-19 05:38:22.319462"], ["updated_at", "2021-11-19 05:38:22.319462"]]