w6/d4/routes_and_controllers/app/controllers/artwork_shares_controller.rb

  def index
    shares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"