w6/d4/routes_and_controllers/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    user_id = params[:user_id]
    user = User.find(user_id)