w6/d4/routes_and_controllers/app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "good art"], ["user_id", 1], ["artwork_id", 2], ["created_at", "2021-10-07 21:08:00.386944"], ["updated_at", "2021-10-07 21:08:00.386944"]]

  def index
    artwork_id = params[:artwork_id]
    user_id = params[:user_id]
    if artwork_id
      comments = Comment.where(artwork_id: artwork_id)
    elsif user_id
      comments = Comment.where(user_id: user_id)
    else
      comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 5]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments"