w6/d4/routes_and_controllers/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."likeable_type" = $1  [["likeable_type", "Comment"]]
SELECT "likes".* FROM "likes"
---
  def index
    type = params[:type]
    if type == "artwork"
      like = Like.where(likeable_type: "Artwork")
    elsif type == "comment"
      like = Like.where(likeable_type: "Comment")
    else
      like = Like.all

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    like = Like.find(params[:id])

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["likeable_type", "Artwork"], ["likeable_id", 3], ["created_at", "2021-10-07 23:23:43.018072"], ["updated_at", "2021-10-07 23:23:43.018072"]]
---
  def create
    like = Like.new(params.require(:like).permit(:likeable_type, :likeable_id, :user_id))
    if like.save