w6/d4/routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%m%')
---
  def index
    querey = params[:search]
    if querey
      users = User.where('username LIKE ?', "%#{querey}%")
    else
      users = User.all